b8oneApi/app/controllers/todos_controller.rb

    def index
        @todos = Todo.all
---
SELECT "todos".* FROM "todos"

    def create
        @todo = Todo.create(todo_params)
---
INSERT INTO "todos" ("title", "created_by", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "teste"], ["created_by", "Leo"], ["created_at", "2017-07-14 22:18:02.053741"], ["updated_at", "2017-07-14 22:18:02.053741"]]

    def update
        @todo.update(todo_params)
---
UPDATE "todos" SET "title" = ?, "created_by" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["title", "Teste 2"], ["created_by", "Leo Rente"], ["updated_at", "2017-07-15 19:59:32.080972"], ["id", 2]]

    def destroy
        @todo.destroy
---
DELETE FROM "todos" WHERE "todos"."id" = ?  [["id", 3]]

    def set_todo
        @todo = Todo.find(params[:id])
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]